tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "sass/sass"
# Platform built on V8 to build network applications
brew "node", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Tool Command Language
brew "tcl-tk"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer
brew "tmux"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku", link: false
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# GPU-accelerated terminal emulator
cask "alacritty"
# Screenshot software
cask "flameshot"
# Typeface made for developers
cask "font-jetbrains-mono"
